#!/bin/bash

# Версія ядра
uname -r

# Архітектура ядра
uname -m

# Версія дистрибутива
lsb_release -d

# Довідка по ls
man ls

# Змінити користувача на адміністратора
sudo su

# Перейти в каталог
cd /var/log

# Домашній каталог
cd 

# Змінні середовища
env

# Змінна HOME
echo $HOME

# Встановити змінну зі значенням
export aaa=bbb
echo $aaa

# Видалити змінну
unset aaa

# Список команд:
history

# Встановити змінну з історії:
# !n (n - номер команди із списку)
echo $aaa

# Повернутись до звичайного користувача:
exit # or Ctrl + D
echo $aaa

